SunCity/src/Enums/СтатусыДокументовИСЦЭДМ/СтатусыДокументовИСЦЭДМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовИСЦЭДМ</name>
  <comment>(Сервер)</comment>
  <enumValues>
    <name>Черновик</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
    <comment>2</comment>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодтверждение</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>Принят</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриПроверке</name>
    <comment>12</comment>
  </enumValues>
  <enumValues>
    <name>Отозван</name>
    <comment>16</comment>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
    <comment>17</comment>
  </enumValues>
  <enumValues>
    <name>РасчетИтогов</name>
    <comment>18</comment>
  </enumValues>
  <enumValues>
    <name>Сформирован</name>
    <comment>11</comment>
  </enumValues>
  <enumValues>
    <name>ЗапрошеноУточнение</name>
  </enumValues>
  <enumValues>
    <name>НеОпределен</name>
    <comment>14</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьНаСогласовании</name>
    <comment>8</comment>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
    <comment>0</comment>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
    <comment>10</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибкаПриОбработке</name>
    <comment>13</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьГотовКРегистрации</name>
    <comment>19</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиПриОтправке</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиПриПриеме</name>
    <comment>21</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьПодписан</name>
    <comment>22</comment>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/СтатусыДокументовИСЦЭДМ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Черновик); //промежуточный статус, документ успешно зарегистрирован и ожидает подписи ЭЦП
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Отклонен); //для Актов, отклонен получателем
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.ОжидаетПодтверждение); //для Актов, успешно отправлен получателю, может быть отозван
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Принят); //для Актов, подтвержден получателем
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.ОшибкаПриПроверке); //промежуточный статус, если в момент первичной регистрации на сервере обнаружены ошибки в данных кодов маркировки
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Отозван); //для Актов
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Аннулирован); //?
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.РасчетИтогов); //промежуточный статус при отправке документов, нужно провести заполнение цен (в 1С выполняется автоматически).
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.Сформирован); //для Уведомлений, документ успешно принят сервером
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСЦЭДМ.НеОпределен); //наш внутренний статус, документ не отправлялся на сервер
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
